app/controllers/musics_controller.rb

  def index
    @musics = Music.all
---
SELECT "musics".* FROM "musics"

  def create
    @music = Music.new(music_params)

    respond_to do |format|
      if @music.save
---
INSERT INTO "musics" ("audio_file_name", "audio_content_type", "audio_file_size", "audio_updated_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @music.update(music_params)
---
UPDATE "musics" SET "audio_file_name" = $1, "audio_file_size" = $2, "audio_updated_at" = $3, "updated_at" = $4 WHERE "musics"."id" = $5  [["audio_file_name", "Basshunter.mp3"], ["audio_file_size", 2924074], ["audio_updated_at", "2016-06-18 06:16:03.149213"], ["updated_at", "2016-06-18 06:16:03.171395"], ["id", 4]]

  def destroy
    @music.destroy
---
DELETE FROM "musics" WHERE "musics"."id" = $1  [["id", 5]]

    def set_music
      @music = Music.find(params[:id])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = $1 LIMIT 1  [["id", 5]]